```
/usr/bin/terraform plan
data.aws_caller_identity.current: Reading...
data.aws_region.current_region: Reading...
data.aws_region.current_region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 0s [id=061051226319]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.project_data_bucket will be created
  + resource "aws_s3_bucket" "project_data_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bmin5100_kianlew"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Owner" = "kian.lew@pennmedicine.upenn.edu"
        }
      + tags_all                    = {
          + "Owner" = "kian.lew@pennmedicine.upenn.edu"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.project_data_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "project_data_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.project_data_bucket_expiration will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "project_data_bucket_expiration" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "compliance-retention-policy"
          + prefix = (known after apply)
          + status = "Enabled"

          + expiration {
              + days                         = 100
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_ownership_controls.project_data_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "project_data_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Process finished with exit code 0
```
